---
type: AnalyticalDistributionNodePropertyData
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 3
tags: [revit-api, class]
---

# AnalyticalDistributionNodePropertyData

`Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NumberOfPhases | 2023 | `public int NumberOfPhases { get ; }` |